In [11]:
import pandas as pd

In [29]:
titanic_train = 'https://raw.githubusercontent.com/lobachevksy/teaching/main/titanic/train.csv'
titanic_test = 'https://raw.githubusercontent.com/lobachevksy/teaching/main/titanic/test.csv'
example = 'https://raw.githubusercontent.com/lobachevksy/teaching/main/titanic/example_submission.csv'

In [30]:
df = pd.read_csv(titanic_train)

In [31]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 1. Data Preparation

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

#### Drop unnecessary columns

In [33]:
df = df.drop(columns=["PassengerId", "Name", "Ticket", "Cabin","SibSp","Parch"])
df.head()

   Survived  Pclass     Sex   Age     Fare Embarked
0         0       3    male  22.0   7.2500        S
1         1       1  female  38.0  71.2833        C
2         1       3  female  26.0   7.9250        S
3         1       1  female  35.0  53.1000        S
4         0       3    male  35.0   8.0500        S

#### Handling non-numeric columns

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   Fare      891 non-null    float64
 5   Embarked  889 non-null    object
dtypes: float64(2), int64(2), object(2)
memory usage: 41.9+ KB

In [35]:
df["Sex"].replace({"female":0, "male":1}, inplace=True)

In [36]:
df.head()

   Survived  Pclass  Sex   Age     Fare Embarked
0         0       3    1  22.0   7.2500        S
1         1       1    0  38.0  71.2833        C
2         1       3    0  26.0   7.9250        S
3         1       1    0  35.0  53.1000        S
4         0       3    1  35.0   8.0500        S

#### Missing values (NaN	)

In [37]:
# check if there any missing values
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    int64
 3   Age       714 non-null    float64
 4   Fare      891 non-null    float64
 5   Embarked  889 non-null    object
dtypes: float64(2), int64(3), object(1)
memory usage: 41.9+ KB

In [38]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
Embarked      2
dtype: int64

In [39]:
# average age
round(df["Age"].mean())

30

In [40]:
# fill missing values with average age
# df['Age'].fillna( value = 30 )

df["Age"] = df["Age"].fillna(value = 30)

In [41]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
Fare        0
Embarked    2
dtype: int64

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    int64
 3   Age       891 non-null    float64
 4   Fare      891 non-null    float64
 5   Embarked  889 non-null    object
dtypes: float64(2), int64(3), object(1)
memory usage: 41.9+ KB

#### One-hot encoding

In [44]:
pd.get_dummies(df, ["Embarked"])

     Survived  Pclass  Sex   Age     Fare  Embarked_C  Embarked_Q  Embarked_S
0           0       3    1  22.0   7.2500           0           0           1
1           1       1    0  38.0  71.2833           1           0           0
2           1       3    0  26.0   7.9250           0           0           1
3           1       1    0  35.0  53.1000           0           0           1
4           0       3    1  35.0   8.0500           0           0           1
..        ...     ...  ...   ...      ...         ...         ...         ...
886         0       2    1  27.0  13.0000           0           0           1
887         1       1    0  19.0  30.0000           0           0           1
888         0       3    0  30.0  23.4500           0           0           1
889         1       1    1  26.0  30.0000           1           0           0
890         0       3    1  32.0   7.7500           0           1           0

[891 rows x 8 columns]

In [45]:
df = pd.get_dummies(df, ["Embarked"])

#### Split into X and y

In [46]:
X = df.copy()
y = X.pop("Survived")

#### Train-Test-Split

In [47]:
from sklearn.model_selection import train_test_split as tts

In [48]:
X_train, X_test, y_train, y_test = tts(X, y, test_size=0.2)

###### Data is ready for modeling!

## 2. Modelling

Fit the model (Logistic Regression) and show scores on training and test datasets.

In [94]:
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score
from sklearn.metrics import accuracy_score, classification_report, confusion_matrix

model = LogisticRegression()
model.fit(X_train,y_train)

C:\Users\Almaz\anaconda3\Lib\site-packages\sklearn\linear_model\_logistic.py:460: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [95]:
predict = model.predict(X_train)
test_predict = model.predict(X_train)

In [96]:

train_accuracy = accuracy_score(y_train, predict)
print(train_accuracy)

0.8061797752808989

## 3. Making Predictions

In [97]:
df_test = pd.read_csv(titanic_test)
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [98]:
submission = df_test[["PassengerId"]]
submission

     PassengerId
0            892
1            893
2            894
3            895
4            896
..           ...
413         1305
414         1306
415         1307
416         1308
417         1309

[418 rows x 1 columns]

#### Prepare the test data in the same way as train data!

In [99]:
df_test = df_test.drop(columns=["PassengerId", "Name", "Ticket", "Cabin","SibSp","Parch"])
df_test["Sex"].replace({"male": 1, "female": 0}, inplace=True)
df_test = pd.get_dummies(df_test, ["Embarked"])

In [102]:
df_test.isnull().sum()

Pclass        0
Sex           0
Age           0
Fare          0
Embarked_C    0
Embarked_Q    0
Embarked_S    0
dtype: int64

### TASK: Fill the missing values in Age and Fare columns with mean values

In [108]:
df_test["Age"] = df_test["Age"].fillna(value = 30)
df_test["Fare"] = df_test["Fare"].fillna(value = 36)

### TASK: Make a predictions using the estimated Logistic Regression Model and save results into `Survived` column of `submission` dataframe

In [127]:
predictions = model.predict(df_test)

In [133]:
submission["Survived"] = predictions
print(submission.head())

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

### Saving the results:

In [134]:
submission.to_csv("my_prediction.csv", index=False)

#### Submit the results in Kaggle!!!

<img src="https://i.imgflip.com/3nc2l0.jpg">